tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
# Platform built on V8 to build network applications
brew "node"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Terminal multiplexer
brew "tmux"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Voice and text chat software
cask "discord"
# Eclipse IDE for Java and DSL developers
cask "eclipse-dsl"
cask "font-symbols-only-nerd-font"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
